yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
        // 每10秒检查一次是否漏服
        current_tick = xTaskGetTickCount();
        if ((current_tick - last_miss_check_tick) >= pdMS_TO_TICKS(10000)) {
            check_missed_doses();
            last_miss_check_tick = current_tick;
        }
       
        // ==========================================
        // 第一部分：数据接收，追加进入历史数组并自动存 Flash
        // ==========================================
        if(xQueueReceive(sensor_data_lcd_queue, &sensor_lcd_packet, pdMS_TO_TICKS(20)) == pdPASS) 
        {
            switch(sensor_lcd_packet.id)
            {
                case SENSOR_ID_HEART_RATE_SPO2: {
                    uint16_t hr = (sensor_lcd_packet.data[0] << 8) | sensor_lcd_packet.data[1];
                    uint16_t spo2 = (sensor_lcd_packet.data[2] << 8) | sensor_lcd_packet.data[3];
                    // 核心修改：追加到历史数组并存 Flash
                    Add_History_HR_SpO2(hr, spo2); 
                    break;
                }
                case SENSOR_ID_MLX_TEMP_BOTH: {
            // 使用小端模式解析 (低位在前)
            uint16_t bt = (uint16_t)(sensor_lcd_packet.data[0] | (sensor_lcd_packet.data[1] << 8));
    
            // 如果原数据有可能是负数（虽然体温通常为正），建议转为 int16_t
            int16_t bt_signed = (int16_t)bt;
            Add_History_BodyTemp(bt_signed);
            break;
}
                case SENSOR_ID_TEMPERATURE_HUMIDITY: {
                    uint16_t et = (sensor_lcd_packet.data[0] << 8) | sensor_lcd_packet.data[1];
                    uint16_t eh = (sensor_lcd_packet.data[2] << 8) | sensor_lcd_packet.data[3];
                    Add_History_EnvTH(et, eh);
                    break;
                }
            }
        }
        

        // 限制 1秒 更新一次全局系统时间
        current_tick = xTaskGetTickCount();
        if ((current_tick - last_rtc_update_tick) >= pdMS_TO_TICKS(1000)) 
        {
            last_rtc_update_tick = current_tick;
            BSP_RTC_GetDateTime(&g_ui_data[g_current_active_user_id].time);
            g_ui_data[g_current_active_user_id].update_flags |= UI_FLAG_TIME;
        }

        //  /*检查是否是新的一天，清除med_status*/
        // if(g_ui_data[g_current_active_user_id].time.hour == 0 && g_ui_data[g_current_active_user_id].time.min == 0 && g_ui_data[g_current_active_user_id].time.sec < 5) {
        //     memset(g_ui_data[g_current_active_user_id].med_status, 0, sizeof(g_ui_data[g_current_active_user_id].med_status));
        // }
        // ==========================================
        // 第二部分：统一执行 LVGL UI 渲染 (显示数组中最新的数据)
        // ==========================================
        static lv_obj_t *last_scr = NULL;
        lv_obj_t *curr_scr = lv_scr_act();
        
        // 如果页面发生了切换，强制刷新所有数据，防止进入新页面后数据显示为空
        if (curr_scr != last_scr) {
            g_ui_data[g_current_active_user_id].update_flags = 0xFFFFFFFF;
            last_scr = curr_scr;
        }

        if (g_ui_data[g_current_active_user_id].update_flags != 0) 
        {
            if(xSemaphoreTake(xGuiMutex, pdMS_TO_TICKS(100)) == pdTRUE) 
            {
                // 强制同步：确保 my_meds 始终与 g_ui_data (Flash数据) 一致
                extern AlarmSche my_meds[3];
                memcpy(my_meds, g_ui_data[g_current_active_user_id].meds_schedule, sizeof(my_meds));

                // 1. 刷新心率血氧 (读取数组最后一个元素)
                if ((g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_HR_SPO2) && g_ui_data[g_current_active_user_id].hr_count > 0) {
                    uint16_t latest_hr = g_ui_data[g_current_active_user_id].hr_history[g_ui_data[g_current_active_user_id].hr_count - 1].hr;
                    uint16_t latest_spo2 = g_ui_data[g_current_active_user_id].hr_history[g_ui_data[g_current_active_user_id].hr_count - 1].spo2;
                    if (lv_obj_is_valid(guider_ui.screen_2_label_13))
                        lv_label_set_text_fmt(guider_ui.screen_2_label_13, "%d b", latest_hr/100); 
                    if (lv_obj_is_valid(guider_ui.screen_2_label_14))
                        lv_label_set_text_fmt(guider_ui.screen_2_label_14, "%d %%", latest_spo2/100); 
                }

                // 2. 刷新体温 
                if ((g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_BODY_TEMP) && g_ui_data[g_current_active_user_id].bt_count > 0) {
                    uint16_t latest_bt = g_ui_data[g_current_active_user_id].bt_history[g_ui_data[g_current_active_user_id].bt_count - 1].body_temp;
                    if (lv_obj_is_valid(guider_ui.screen_2_label_15)) 
                        lv_label_set_text_fmt(guider_ui.screen_2_label_15, "%d.%02d°C", latest_bt/100, latest_bt%100);
                }

                // 3. 刷新环境温湿度
                if ((g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_ENV_TH) && g_ui_data[g_current_active_user_id].env_count > 0) {
                    uint16_t latest_et = g_ui_data[g_current_active_user_id].env_history[g_ui_data[g_current_active_user_id].env_count - 1].env_temp;
                    uint16_t latest_eh = g_ui_data[g_current_active_user_id].env_history[g_ui_data[g_current_active_user_id].env_count - 1].env_humi;
                    if (lv_obj_is_valid(guider_ui.screen_label_7))
                        lv_label_set_text_fmt(guider_ui.screen_label_7, "%d.%02d°C", latest_et/100, latest_et%100);
                    if (lv_obj_is_valid(guider_ui.screen_label_8))
                        lv_label_set_text_fmt(guider_ui.screen_label_8, "%d.%02d %%", latest_eh/100, latest_eh%100);
                }

                 /*显示wifi状态*/
                if (lv_obj_is_valid(guider_ui.screen_label_2))
                {
                    lv_label_set_text_fmt(guider_ui.screen_label_2, "%c", g_ui_data[g_current_active_user_id].wifi_status);
                }

                // 4. 刷新时间
                if (g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_TIME) {
                    if (lv_obj_is_valid(guider_ui.screen_label_4))
                        lv_label_set_text_fmt(guider_ui.screen_label_4, "%02d:%02d:%02d", 
                            g_ui_data[g_current_active_user_id].time.hour, g_ui_data[g_current_active_user_id].time.min, g_ui_data[g_current_active_user_id].time.sec);
                    if (lv_obj_is_valid(guider_ui.screen_label_3))
                        lv_label_set_text_fmt(guider_ui.screen_label_3, "%04d/%02d/%02d",
                             g_ui_data[g_current_active_user_id].time.year, g_ui_data[g_current_active_user_id].time.month, g_ui_data[g_current_active_user_id].time.day);
                }


                // 6. 刷新漏服记录 — index0=最新，显示4行，第一行最新
                if (g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_RECORDS) {
                    lv_obj_t* labels[] = {
                        guider_ui.screen_2_label_2, // 第一行 — 最新记录 (index 0)
                        guider_ui.screen_2_label_4, // 第二行 — 次新 (index 1)
                        guider_ui.screen_2_label_5, // 第三行 (index 2)
                        guider_ui.screen_2_label_3  // 第四行 — 最旧 (index 3)
                    };
                    for(int i = 0; i < 4; i++) {
                        if(lv_obj_is_valid(labels[i])) {
                            if(i < g_ui_data[g_current_active_user_id].record_count) {
                                lv_label_set_text_fmt(labels[i], "no:%lu time:%s turn:%s",
                                    (unsigned long)g_ui_data[g_current_active_user_id].missed_records[i].id,
                                    g_ui_data[g_current_active_user_id].missed_records[i].date,
                                    g_ui_data[g_current_active_user_id].missed_records[i].time);
                               
                            } else {
                                lv_label_set_text(labels[i], ""); // 无数据则空白
                            }
                        }
                    }
                }
                
                if(g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_SCHEDULE) {
                    if(lv_obj_is_valid(guider_ui.screen_4_label_2))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_2, "Time: %02d:%02d", 
                            g_ui_data[g_current_active_user_id].meds_schedule[0].hour, g_ui_data[g_current_active_user_id].meds_schedule[0].min);
                    
